cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

cask "java"
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "vagrant"
cask "spotify"
cask "whatsapp"
cask "spotify", args: { appdir: "/Applications" }
cask "1password"

# user-prefs

# Native-dev
cask "android-studio", args: { appdir: "/Applications" }
cask "react-native-debugger"
cask "cocoapods" # may not be arm64 compatible


# dev formulae
brew "httpie"
brew "neovim"
brew "watchman"

# dev casks
# cask "postico"
cask "discord"
cask "postman", args: { appdir: "/Applications" }
cask "stats", args: { appdir: "/Applications" }
cask "wireshark"

# System
brew "zsh-completions"
brew "mas"
brew "curl"
brew "wget"
brew "vim"
brew "openssl"
brew "coreutils" # (could interfere with c++ package compilation when using arm64 based mac)
brew "moreutils"
brew "findutils"
brew "binutils"
brew "rename"
brew "gnu-sed"
brew "gnu-tar"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "tree"
brew "htop"
brew "pidof"
brew "pstree"
brew "grep"
brew "openssh"
brew "rsync"
brew "ssh-copy-id"
brew "screen"
brew "gmp"
brew "nmap"
brew "socat"
brew "rlwrap"
brew "dnstracer"
brew "sslscan"

# Git
brew "git"
brew "git-lfs"
brew "gh"
brew "tig"
cask "sourcetree", args: { appdir: "/Applications" }

# Ops
brew "docker"
brew "docker-compose"
brew "awscli"

# Images, Audio, Video
brew "imagemagick"
brew "gifsicle"
brew "gifify"
brew "ffmpeg"

# Archive & Git
brew "xz"
brew "p7zip"

# Extract rpm file content with rpm2cpio *.rpm | cpio -ivd
# brew "rpm2cpio"

# JSON
brew "jq"
brew "jo"

# Dev
brew "python@3.9"
brew "ruby"
brew "yarn"
brew "rbenv"
brew "python"
brew "go"
brew "cmake"
brew "openjdk"
brew "kind"
brew "deno"

# RN dev
cask "react-native-debugger", args: { appdir: "/Applications" }
cask "zeplin"

cask "raspberry-pi-imager"

# App Store
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
mas "Disk Space Analyzer Free", id: 446243721

# Necessary apple bloatware :P
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Deps
brew "glib"
brew "openldap"
brew "guile"
brew "gobject-introspection"
brew "harfbuzz"
brew "libass"
brew "ldns"
brew "libfido2"
brew "perl"
brew "ruby-build"

# Uncategorised
brew "wimlib"
cask "sketch"
brew "cocoapods"
brew "coreutils"
brew "exa"
brew "n"
brew "node"
brew "nvm"
brew "openssl@3"
brew "typescript"
brew "zsh-syntax-highlighting"
cask "1password", args: { appdir: "/Applications" }
cask "fig"
cask "grammarly-desktop"
cask "karabiner-elements"
cask "notion"
cask "postman"
cask "rectangle"
cask "sketch", args: { appdir: "/Applications" }
cask "vagrant", args: { appdir: "/Applications" }
cask "whatsapp", args: { appdir: "/Applications" }
cask "zeplin", args: { appdir: "/Applications" }
brew "zstd"
brew "pycparser", link: false
brew "cffi", link: false
brew "docutils"
brew "python@3.11"
brew "boost"
brew "libidn2"
brew "folly"
brew "edencommon"
brew "libgit2"
brew "fizz"
brew "wangle"
brew "fb303"
brew "fbthrift"
brew "unbound"
brew "tesseract"
brew "flux"
brew "ghq"
brew "libheif"
brew "peco"
brew "postgresql@14"
brew "postgresql@16"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-tk@3.11"
brew "python@3.10"
brew "ripgrep"
brew "tmux"
brew "zsh-autosuggestions"
cask "alfred"
cask "alt-tab"
cask "battle-net"
cask "bitwarden"
cask "cocoapods", args: { appdir: "/Applications" }
cask "figma"
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"
cask "grammarly"
cask "hiddenbar"
cask "iterm2"
cask "microsoft-teams"
cask "pycharm-ce"
cask "raspberry-pi-imager", args: { appdir: "/Applications" }
cask "raycast"
cask "slack"
cask "steam"
cask "warp"
cask "wireshark", args: { appdir: "/Applications" }
vscode "1yib.rust-bundle"
vscode "2gua.rainbow-brackets"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deque-systems.vscode-axe-linter"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "eliverlara.andromeda"
vscode "equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "heybourn.headwind"
vscode "ibrahimcesar.ibrahimcesar-nextjs-developer-pack"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "kelset.rn-full-pack"
vscode "kevinrose.vsc-python-indent"
vscode "leodevbro.blockman"
vscode "mariusalchimavicius.json-to-ts"
vscode "meganrogge.template-string-converter"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "naumovs.color-highlight"
vscode "nur.just-black"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "pulkitgangwar.nextjs-snippets"
vscode "quicktype.quicktype"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "trunk.io"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "walter-ribeiro.full-react-snippets"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yoavbls.pretty-ts-errors"
